<script setup lang="ts">
import { ref } from 'vue'

const klmy1 = ref('/src/assets/img/klmy.png')
const klmy2 = ref('/src/assets/img/klmy2.png')
const klmy3 = ref('/src/assets/img/klmy3.png')
const klmy4 = ref('/src/assets/img/klmy4.png')
const klmy5 = ref('/src/assets/img/klmy5.png')
</script>

<template>
    <div class="theContainer">
        <a-layout-header>
            <div class="header">
                <div class="article-title-info">
                    <span>克里米亚是怎样一步步走上亲俄道路的</span>
                    <br />
                    <div class="article-info">
                        <svg data-v-607a30c4="" viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path
                                data-v-607a30c4=""
                                d="M510.4 65.5l259.69999999 0 1e-8 266.89999999c0 147.50000001-116.2 266.89999999-259.7 266.90000001-143.4 0-259.7-119.5-259.7-266.90000001 0.1-147.5 116.3-266.9 259.7-266.89999999z"
                                fill="#FF9FCF"></path>
                            <path
                                data-v-607a30c4=""
                                d="M698.4 525.2l-13 0c53-48.4 86.5-117.8 86.5-195.20000001 0-10.2-0.7-20.3-1.8-30.19999999C613.8 377.50000001 438.6 444.9 266 437.7c15 33.4 36.7 63.1 63.5 87.5l-5.3 0c-122.6 0-225.5 88.1-248.8 204.1C340 677.2 597.7 609.2 862.2 585.7c-44.3-37.6-101.5-60.5-163.8-60.5z"
                                fill="#FF83BB"></path>
                            <path
                                data-v-607a30c4=""
                                d="M862.2 585.7C597.7 609.2 340 677.2 75.4 729.3c-3.2 16.1-5 32.6-5 49.6 0 99.8 81.7 181.5 181.5 181.5l518.6 0c99.8 0 181.5-81.7 181.5-181.5 0.1-77.2-35-146.5-89.8-193.2z"
                                fill="#FF5390"></path>
                            <path
                                data-v-607a30c4=""
                                d="M770.1 299.8C755.1 168 643.3 65.5 507.4 65.5c-146.1 0-264.5 118.4-264.5 264.5 0 38.4 8.3 74.8 23.1 107.7 172.6 7.2 347.8-60.2 504.1-137.9z"
                                fill="#FF9FCF"></path>
                            <path data-v-607a30c4="" d="M436.4 282.1c0 24.1-19.6 43.7-43.7 43.7S349 306.2 349 282.1s19.6-43.7 43.7-43.7c24.19999999 0 43.7 19.6 43.7 43.7z" fill="#FFFFFF"></path>
                            <path data-v-607a30c4="" d="M625 282.1m-43.7 0a43.7 43.7 0 1 0 87.4 0 43.7 43.7 0 1 0-87.4 0Z" fill="#FFFFFF"></path></svg
                        ><span data-v-607a30c4="">&nbsp;Sara</span><span data-v-607a30c4="">·</span
                        ><svg data-v-607a30c4="" viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path data-v-607a30c4="" d="M512 512m-512 0a512 512 0 1 0 1024 0 512 512 0 1 0-1024 0Z" fill="#409EFF"></path>
                            <path
                                data-v-607a30c4=""
                                d="M654.222222 256c-17.066667 0-28.444444 11.377778-28.444444 28.444444v56.888889c0 17.066667 11.377778 28.444444 28.444444 28.444445s28.444444-11.377778 28.444445-28.444445v-56.888889c0-17.066667-11.377778-28.444444-28.444445-28.444444zM369.777778 256c-17.066667 0-28.444444 11.377778-28.444445 28.444444v56.888889c0 17.066667 11.377778 28.444444 28.444445 28.444445s28.444444-11.377778 28.444444-28.444445v-56.888889c0-17.066667-11.377778-28.444444-28.444444-28.444444z"
                                fill="#FFFFFF"></path>
                            <path
                                data-v-607a30c4=""
                                d="M725.333333 312.888889H711.111111v28.444444c0 31.288889-25.6 56.888889-56.888889 56.888889s-56.888889-25.6-56.888889-56.888889v-28.444444h-170.666666v28.444444c0 31.288889-25.6 56.888889-56.888889 56.888889s-56.888889-25.6-56.888889-56.888889v-28.444444h-14.222222c-22.755556 0-42.666667 19.911111-42.666667 42.666667v341.333333c0 22.755556 19.911111 42.666667 42.666667 42.666667h426.666666c22.755556 0 42.666667-19.911111 42.666667-42.666667v-341.333333c0-22.755556-19.911111-42.666667-42.666667-42.666667zM426.666667 654.222222h-56.888889c-17.066667 0-28.444444-11.377778-28.444445-28.444444s11.377778-28.444444 28.444445-28.444445h56.888889c17.066667 0 28.444444 11.377778 28.444444 28.444445s-11.377778 28.444444-28.444444 28.444444z m227.555555 0h-56.888889c-17.066667 0-28.444444-11.377778-28.444444-28.444444s11.377778-28.444444 28.444444-28.444445h56.888889c17.066667 0 28.444444 11.377778 28.444445 28.444445s-11.377778 28.444444-28.444445 28.444444z m0-113.777778h-56.888889c-17.066667 0-28.444444-11.377778-28.444444-28.444444s11.377778-28.444444 28.444444-28.444444h56.888889c17.066667 0 28.444444 11.377778 28.444445 28.444444s-11.377778 28.444444-28.444445 28.444444z"
                                fill="#FFFFFF"></path></svg
                        ><span data-v-607a30c4="">&nbsp;2022-11-20 10:26:18</span><span data-v-607a30c4="">·</span
                        ><svg data-v-607a30c4="" viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path data-v-607a30c4="" d="M14.656 512a497.344 497.344 0 1 0 994.688 0 497.344 497.344 0 1 0-994.688 0z" fill="#FF0000"></path>
                            <path
                                data-v-607a30c4=""
                                d="M374.976 872.64c-48.299-100.032-22.592-157.44 14.421-211.37 40.448-58.966 51.115-117.611 51.115-117.611s31.659 41.386 19.115 106.005c56.149-62.72 66.816-162.133 58.325-200.405 127.317 88.746 181.59 281.002 108.181 423.381C1016 652.501 723.093 323.2 672.277 285.867c16.939 37.333 20.054 100.032-14.101 130.474-58.027-219.84-201.664-265.002-201.664-265.002 16.96 113.536-61.781 237.397-137.344 330.24-2.816-45.163-5.632-76.544-29.483-119.808-5.333 82.176-68.373 149.269-85.29 231.445-22.912 111.637 17.237 193.173 170.581 279.424z"
                                fill="#FFFFFF"></path></svg
                        ><span data-v-607a30c4="">&nbsp;516</span><span data-v-607a30c4="">·</span
                        ><svg data-v-607a30c4="" viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path
                                data-v-607a30c4=""
                                d="M113.834667 291.84v449.194667a29.013333 29.013333 0 0 0 28.842666 29.013333h252.928v90.453333l160.597334-90.453333h252.928a29.013333 29.013333 0 0 0 29.013333-29.013333V291.84a29.013333 29.013333 0 0 0-29.013333-29.013333h-665.6a29.013333 29.013333 0 0 0-29.696 29.013333z"
                                fill="#FFDEAD"></path>
                            <path
                                data-v-607a30c4=""
                                d="M809.130667 262.826667h-665.6a29.013333 29.013333 0 0 0-28.842667 29.013333v40.106667a29.013333 29.013333 0 0 1 28.842667-29.013334h665.6a29.013333 29.013333 0 0 1 29.013333 29.013334V291.84a29.013333 29.013333 0 0 0-29.013333-29.013333z"
                                fill="#FFF3DB"></path>
                            <path
                                data-v-607a30c4=""
                                d="M556.202667 770.048h252.928a29.013333 29.013333 0 0 0 29.013333-29.013333V362.837333s-59.733333 392.533333-724.309333 314.709334v63.488a29.013333 29.013333 0 0 0 28.842666 29.013333h253.098667v90.453333z"
                                fill="#F2C182"></path>
                            <path
                                data-v-607a30c4=""
                                d="M619.008 632.32l101.888-35.157333-131.754667-76.117334 29.866667 111.274667zM891.904 148.992a61.44 61.44 0 0 0-84.138667 22.528l-19.968 34.133333 106.666667 61.610667 19.968-34.133333a61.781333 61.781333 0 0 0-22.528-84.138667z"
                                fill="#69BAF9"></path>
                            <path data-v-607a30c4="" d="M775.338667 198.775467l131.669333 76.032-186.026667 322.218666-131.6864-76.032z" fill="#F7FBFF"></path>
                            <path
                                data-v-607a30c4=""
                                d="M775.168 198.826667l-5.290667 9.216 59.221334 34.133333a34.133333 34.133333 0 0 1 12.458666 46.592l-139.946666 242.346667a34.133333 34.133333 0 0 1-46.762667 12.629333l-59.050667-34.133333-6.656 11.434666 88.746667 51.2L720.896 597.333333l186.026667-322.56z"
                                fill="#D8E3F0"></path>
                            <path
                                data-v-607a30c4=""
                                d="M616.448 622.592l2.56 9.728 101.888-35.157333-44.885333-25.941334-59.562667 51.370667zM891.904 148.992c-1.024 0-2.218667-0.853333-3.242667-1.536A61.610667 61.610667 0 0 1 887.466667 204.8l-19.968 34.133333-73.728-42.496-5.12 8.704 106.666666 61.610667 19.968-34.133333a61.781333 61.781333 0 0 0-23.381333-83.626667z"
                                fill="#599ED4"></path>
                            <path
                                data-v-607a30c4=""
                                d="M265.898667 417.621333H494.933333a17.066667 17.066667 0 1 0 0-34.133333H265.898667a17.066667 17.066667 0 1 0 0 34.133333zM265.898667 533.504H494.933333a17.066667 17.066667 0 0 0 0-34.133333H265.898667a17.066667 17.066667 0 0 0 0 34.133333z"
                                fill="#3D3D63"></path>
                            <path
                                data-v-607a30c4=""
                                d="M959.488 354.645333a99.84 99.84 0 0 0-23.722667-127.488 78.677333 78.677333 0 0 0-142.848-64.170666l-11.605333 20.138666a17.066667 17.066667 0 0 0-20.821333 7.168l-32.085334 55.466667H142.677333a46.250667 46.250667 0 0 0-45.909333 46.08v449.194667a46.08 46.08 0 0 0 45.909333 46.08h236.032v73.386666a17.066667 17.066667 0 0 0 8.362667 14.848 17.066667 17.066667 0 0 0 8.704 2.218667 17.066667 17.066667 0 0 0 8.362667-2.218667l156.672-88.234666h248.32a46.08 46.08 0 0 0 46.08-46.08V398.677333L921.6 283.306667a17.066667 17.066667 0 0 0-4.266667-21.504l1.877334-3.413334a65.365333 65.365333 0 0 1 10.410666 79.189334l-53.077333 91.989333a56.832 56.832 0 0 0 20.821333 77.653333 17.066667 17.066667 0 0 0 24.234667-6.314666 17.066667 17.066667 0 0 0-6.997333-23.04 23.04 23.04 0 0 1-8.362667-31.061334z m-138.410667 386.389334a11.946667 11.946667 0 0 1-11.946666 11.946666H556.202667a17.066667 17.066667 0 0 0-8.362667 2.218667l-134.997333 76.117333v-61.269333a17.066667 17.066667 0 0 0-17.066667-17.066667H142.677333a11.946667 11.946667 0 0 1-11.776-11.946666V291.84a11.946667 11.946667 0 0 1 11.776-11.946667h565.930667L574.464 512a17.066667 17.066667 0 0 0-1.706667 12.970667L597.333333 615.253333H265.898667a17.066667 17.066667 0 1 0 0 34.133334h352.938666a17.066667 17.066667 0 0 0 5.802667 0l102.4-35.328a17.066667 17.066667 0 0 0 9.216-7.509334l85.333333-147.968z m-204.8-184.661334l63.829334 36.864-49.322667 17.066667z m206.848-170.666666v1.365333l-108.373333 186.709333-102.4-59.050666L781.482667 221.866667l102.4 59.050666z m76.458667-161.28L887.466667 244.224l-76.970667-44.373333 11.264-19.797334a44.544 44.544 0 1 1 77.141333 44.544z"
                                fill="#3D3D63"></path></svg
                        ><span data-v-607a30c4="">&nbsp;5</span><span data-v-607a30c4="">·</span
                        ><svg data-v-607a30c4="" viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path
                                data-v-607a30c4=""
                                d="M510.671749 348.792894S340.102978 48.827055 134.243447 254.685563C-97.636714 486.565724 510.671749 913.435858 510.671749 913.435858s616.107079-419.070494 376.428301-658.749272c-194.095603-194.096626-376.428302 94.106308-376.428301 94.106308z"
                                fill="#FF713C"></path>
                            <path
                                data-v-607a30c4=""
                                d="M510.666632 929.674705c-3.267417 0-6.534833-0.983397-9.326413-2.950192-16.924461-11.872399-414.71121-293.557896-435.220312-529.448394-5.170766-59.482743 13.879102-111.319341 56.643068-154.075121 51.043536-51.043536 104.911398-76.930113 160.095231-76.930114 112.524796 0 196.878996 106.48115 228.475622 153.195078 33.611515-45.214784 122.406864-148.20646 234.04343-148.20646 53.930283 0 105.46603 24.205285 153.210428 71.941496 45.063335 45.063335 64.954361 99.200326 59.133795 160.920016C935.306982 641.685641 536.758893 915.327952 519.80271 926.859589a16.205077 16.205077 0 0 1-9.136078 2.815116zM282.857183 198.75574c-46.25344 0-92.396363 22.682605-137.127124 67.413365-36.149315 36.157501-51.614541 78.120218-47.25321 128.291898 17.575284 202.089671 352.199481 455.119525 412.332023 499.049037 60.434417-42.86732 395.406538-289.147446 414.567947-492.458945 4.933359-52.344159-11.341303-96.465029-49.759288-134.88199-41.431621-41.423435-85.24243-62.424748-130.242319-62.424748-122.041544 0-220.005716 152.203494-220.989114 153.742547-3.045359 4.806469-8.53335 7.883551-14.101159 7.534603a16.257266 16.257266 0 0 1-13.736863-8.184403c-0.902556-1.587148-91.569532-158.081365-213.690893-158.081364z"
                                fill="#885F44"></path></svg
                        ><span data-v-607a30c4="">&nbsp;0</span>
                    </div>
                </div>
            </div>
        </a-layout-header>
        <a-layout-content>
            <div class="main">
                <div class="articleContainer">
                    <div class="entry-content">
                        <blockquote>
                            <p>克里米亚的黑海港口可快速前往东地中海、巴尔干和中东地区。因此，克里米亚南岸自古以来就是各大帝国的征服目标。</p>
                        </blockquote>
                        <h3>沙俄版图下的克里米亚</h3>
                        <p>有“黑海门户”之称的克里米亚半岛，因为地理位置上的优异，千年以来经历了许多国家和帝国的统治，也有许多民族居住在其间。</p>
                        <p><img :src="klmy1" alt="俄罗斯帝国版图.png" /></p>
                        <h3>第六次俄土战争</h3>
                        <p>1787-1792 年第六次俄土战争，俄罗斯在此战争的胜利迫使土耳其人彻底放弃对克里米亚半岛的主权，承认其归属于俄罗斯的版图。</p>
                        <p><img :src="klmy2" alt="第六次俄土战争.jpg" /></p>
                        <h4>克里米亚战争</h4>
                        <p>
                            1853 年俄罗斯帝国与土耳其帝国之间爆发了“克里米亚战争”，又称“第九次俄土战争”，原因是奥斯曼帝国内部逐渐地瓦解，俄罗斯认为这是其向欧洲扩张的好机会。<br />
                            1854 年底法兰西帝国、大英帝国也对俄宣战，它们不希望俄罗斯获得这些战略要地，以维持它们自己在东南欧的势力和利益。隔年萨丁尼亚王国决定加入此一同盟。<br />
                            1854年9月，联军在克里米亚半岛登陆并围攻俄罗斯黑海舰队基地塞瓦斯托波尔要塞。塞瓦斯托波尔被围攻近一年后，在法军攻入马拉科夫堡后，联军占领了这个重要的堡垒，此后俄军退出克里米亚半岛，并向联军投降。
                        </p>
                        <p><img :src="klmy3" alt="英法联军围攻塞瓦斯托波尔.jpg" /></p>
                        <p>1856年初，交战各方开始在巴黎进行和谈。经过两个月的讨价还价，各方签订了《巴黎和约》：</p>
                        <ul>
                            <li>俄罗斯收复克里米亚，但失去了之前在巴尔干与高加索夺取的大量土地。</li>
                            <li>黑海被宣布中立化，俄军被禁止在黑海重建舰队与军事设施</li>
                            <li>土耳其对各附属国的宗主权得到列强的承认与保护。</li>
                        </ul>
                        <p>
                            帝俄时期的俄国试图俄化克里米亚半岛，在 19
                            世纪时开始鼓励俄罗斯人移入此地，同时凯瑟琳大帝及其后继者对克里米亚鞑靼人采取高压政策。克里米亚鞑靼人面临土地被没收、政治迫害等，而被迫迁离半岛。
                        </p>
                        <p><img :src="klmy4" alt="微信截图_20221120103706.png" /></p>
                        <h3 id="toc-3">苏联麾下的克里米亚</h3>
                        <p>
                            十月革命结束之后，布尔什维克党在克里米亚半岛上取得政权，于 1918
                            年建立了塔夫里社会主义苏维埃共和国。然而这个政权维持一个多月后，即因为第一次世界大战时，克里米亚半岛遭到德军占领而结束，直到 1919
                            年才重新被俄罗斯掌控，并建立了克里米亚社会主义苏维埃共和国。
                        </p>
                        <p>苏联时期，克里米亚半岛的地位更是数次遭到变更：</p>
                        <ul>
                            <li>1921 年 10 月 18日，克里米亚以自治区的身分加入俄罗斯苏维埃社会主义共和国，废除了先前的民族特权与宗教的限制，主张其领土上的所有民族皆拥有平等且自由发展的权利。</li>
                            <li>1920 年代，苏联政府实施了本土化政策，试图降低不同民族之间的矛盾，提升克里米亚鞑靼人的自治权。</li>
                            <li>1930 年代末期，斯大林终止了本土化政策，并对克里米亚鞑靼人采取高压政策，处决了大部份的克里米亚鞑靼知识分子。</li>
                            <li>第二次世界大战期间，斯大林更以“与德国占领军合作”为名，于 1944 年将克里米亚鞑靼人逐出半岛。</li>
                            <li>1945 年撤销了克里米亚自治苏维埃社会主义共和国的地位，降低其自治的权限，并且降格为克里米亚州。大批俄罗斯族人迁入，半岛的居民结构被永久性改变。</li>
                        </ul>
                        <p>俄罗斯人的势力在半岛上的扩张及深耕，在帝俄前期就已表露无遗。到了苏联前期，整个克里米亚半岛一度可以说是仅剩俄罗斯人及乌克兰人。</p>
                        <p><img :src="klmy5" alt="微信截图_20221120103643.png" /></p>
                        <p>
                            斯大林去世后，赫鲁晓夫上台。早年曾长期在乌克兰工作，曾任乌克兰第一书记的赫鲁晓夫对乌克兰的斯拉夫兄弟充满深情。1953
                            年赫鲁雪夫在庆祝俄罗斯与乌克兰签订的《佩列亚斯拉夫协定》满300 周年之际，于 1954 年 2 月 19
                            日将克里米亚州连同塞凡斯托波尔一起划入乌克兰苏维埃社会主义共和国管辖下。这一决定埋下了日后克里米亚半岛与乌克兰之间种种冲突的种子。
                        </p>
                        <p>
                            苏联末期，民族间的冲突在苏联全国范围内爆发，乌克兰虽然免于发生内战，但仍无法阻止克里米亚半岛上分离主义情绪的上扬。乌克兰选择了一个折衷方案，一方面为了防止克里米亚半岛的分裂，给予其自治的权利；另一方面消弥克里米亚地方政府的势力。但长远来看，这种将根本问题搁置一旁的做法，使这些问题在未来不可避免地再次发生。
                        </p>
                        <h3 id="toc-4">乌克兰独立后的克里米亚</h3>
                        <p>乌克兰独立之后，克里米亚半岛内部的分离主义以及亲俄势力并未减弱，尽管始终受到乌克兰的牵制，但是克里米亚当局一直试图寻求政治上的自主性。</p>
                        <p>
                            乌克兰政党之间的势力以及乌克兰的政局自独立近 30
                            年以来有很大的变化，内部的政治意识从共产主义逐渐过渡到民族主义，再到亲欧主义。乌克兰独立之后其国家的发展政策及方向与克里米亚大多数居民所期望的逐渐不同。在两者之间的共识差距越来越远的情况下，乌克兰与克里米亚半岛之间的冲突无疑地会再度爆发，而亲欧盟示威运动则成了其中的导火线。
                        </p>
                        <h5>下集预告</h5>
                        <p>克里米亚公投：俄乌战争的起点</p>
                        <blockquote>
                            <p>作者: Sara</p>
                            <p>版权声明: 转载请注明出处</p>
                        </blockquote>
                    </div>
                    <div id="article-like" class="myCenter"><icon-thumb-up-fill :style="{ fontSize: '40px', color: '#ddd' }" /></div>
                    <div></div>
                </div>
            </div>
        </a-layout-content>
    </div>
</template>

<style scoped>
@import '@/assets/css/typora-theme-wbm.css';
.layout-demo :deep(.arco-layout-header),
.layout-demo :deep(.arco-layout-footer),
.layout-demo :deep(.arco-layout-content) {
    display: flex;
    flex-direction: column;
    justify-content: center;
    font-size: 16px;
    font-stretch: condensed;
    text-align: center;
}

.layout-demo :deep(.arco-layout-header),
.layout-demo :deep(.arco-layout-footer) {
    height: 64px;
    background-color: var(--color-primary-light-4);
}

.layout-demo :deep(.arco-layout-content) {
    background-color: rgb(var(--arcoblue-6));
}

.header {
    width: 100vw;
    height: 40vh;
    background-image: url('@/assets/img/headerBackground.png');
    background-size: cover;
    background-repeat: no-repeat;
    background-position: 0 50%;
    display: flex;
    flex-direction: column;
    justify-content: flex-end;
    align-items: center;
    position: relative;
}

.header::before {
    position: absolute;
    width: 100%;
    height: 100%;
    background-color: var(--miniMask);
    content: '';
}

.article-title-info {
    position: relative;
    display: flex;
    flex-direction: column;
    margin-right: 40%;
    margin-bottom: 30px;
    z-index: 1;
}

.article-title-info > span {
    font-size: 30px;
    color: white;
}

.article-info span {
    color: white;
}

.main {
    background: var(--background);
}

.articleContainer {
    max-width: 800px;
    margin: 0 auto;
    padding: 40px 20px;
}

/*.myCenter {*/
/*    display: flex;*/
/*    justify-content: center;*/
/*    align-items: center;*/
/*}*/

.myCenter {
    display: flex;
    justify-content: center;
    align-items: center;
}

.article-like-icon {
    font-size: 60px;
    cursor: pointer;
    color: var(--greyFont);
    transition: all 0.5s;
    border-radius: 50%;
    margin-bottom: 20px;
}

.el-icon-thumb:before {
    content: '\e739';
}
</style>
